{"max_len": 512, "bos_token": "<s>", "eos_token": "</s>", "unk_token": "<unk>", "sep_token": "</s>", "pad_token": "<pad>", "cls_token": "<s>", "mask_token": "<mask>", "special_tokens_map_file": "/home/yoonsik/.cache/torch/transformers/c4d7dddd3fe79d7bf568281cec3063020da6084295e0054db0e65b7ac4350cff.16f949018cf247a2ea7465a74ca9a292212875e5fd72f969e0807011e7f192e4", "full_tokenizer_file": null}